JK1DVP/esp32-jk1dvplog/dvplogger/main/cmd_interp.cpp
/*
 * dvplogger - field companion for ham radio operator
 * dvplogger - アマチュア無線家のためのフィールド支援ツール
 * Copyright (c) 2021-2026 Eiichiro Araki
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */
// Copyright (c) 2021-2024 Eiichiro Araki
// SPDX-FileCopyrightText: 2025 2021-2025 Eiichiro Araki
//
// SPDX-License-Identifier: GPL-2.0-or-later

#include "Arduino.h"
#include "driver/uart.h"
#include "decl.h"
#include "variables.h"
#include "callhist.h"
#include "callhist_remote.h"
#include "qso.h"
#include "dupechk.h"
#include "ui.h"
#include "log.h"
#include "multi_process.h"
#include "misc.h"
#include "cat.h"
#include "cluster.h"
#include "contest.h"
#include "cluster.h"
#include "settings.h"
#include "bandmap.h"
#include "display.h"
#include "main.h"
#include "sd_files.h"
#include "SD.h"
#include "mcp.h"
#include "satellite.h"
#include "console.h"
#include "timekeep.h"
#include "esp32_flasher.h"
#include "so2r.h"
#include "network.h"
#include "zserver.h"
#include "dac-adc.h"
#include "mcp_interface.h"
#include "morse_decoder_simple.h"
#include "mux_transport.h"
#include "usb_host.h"
#include "cw_keying.h"
#include "web_server.h"
#include "AudioPlayer.h"
int cmd_interp_state = 0;

static Stream *command_output = nullptr;

static Stream *current_command_output()
{
  return command_output ? command_output : console;
}

struct terminal_help_entry {
  const char *command;
  const char *description;
};

static const terminal_help_entry terminal_help_entries[] = {
  {"help", "show this command list"},
  {"emu", "enter terminal screen emulation; EXITEMU exits"},
  {"verbose[n]", "toggle verbose output, or set verbose bit mask n"},
  {"clusterverbose [1|2] [0-3]", "show/set Cluster 1 or 2 traffic display level"},
  {"c1cmd <command>", "send one command immediately to Cluster 1 (not saved)"},
  {"c2cmd <command>", "send one command immediately to Cluster 2 (not saved)"},
  {"loadsat", "load saved satellite information"},
  {"savesat", "save satellite information"},
  {"satellite", "load/update TLE data"},
  {"nextaos", "calculate and display upcoming AOS"},
  {"decoder", "start CW decoder"},
  {"decoderstop", "stop CW decoder"},
  {"play <text>", "speech synthesis output"},
  {"playcw<text>", "send text using tone CW"},
  {"playwpm<n>", "set tone CW speed in WPM"},
  {"playq", "show current audio/CW playback queue"},
  {"newqsolog", "start a new QSO.TXT log"},
  {"zmerge [dry|repair]", "merge, compare, or repair duplicate QSOs"},
  {"makedupe", "rebuild dupe/multiplier data from QSO.TXT"},
  {"dumpqso[n]", "dump current raw QSO log, or backup log n"},
  {"readqso", "print QSO.TXT in importable text format"},
  {"listqsofile", "list available QSO backup files"},
  {"switchlog <0-999>", "switch to the specified QSO backup log"},
  {"mailqso", "reserved command; QSO mail sending is currently disabled"},
  {"dumpcur", "dump the currently selected QSO record"},
  {"dumptop", "dump the first QSO record"},
  {"dumpnext", "dump the next QSO record"},
  {"dumpprev", "dump the previous QSO record"},
  {"dumplast", "dump the last QSO record"},
  {"dump <n>", "dump QSO record number n"},
  {"listdir", "list files in the microSD root directory"},
  {"sdput <file> <size> <crc32>", "receive raw file bytes from serial terminal into microSD"},
  {"ymodem", "receive one file to microSD using YMODEM-CRC (Tera Term compatible)"},
  {"DX de ...", "inject a cluster spot line"},
  {"status", "show radio status"},
  {"setstninfo <call>", "set target station information"},
  {"switch_radio <n>", "switch radio n to the next rig definition"},
  {"enable_radio <n>", "enable/disable radio n"},
  {"focus <n>", "change the focused radio"},
  {"switch_bands", "switch selected radio to the next available band"},
  {"set_rig <name>", "set selected radio by rig definition name"},
  {"show_summary", "show QSO summary"},
  {"show_bandmap", "show bandmap"},
  {"show_multi", "show multiplier list"},
  {"contest_id <n>", "select contest definition number n"},
  {"save[name]", "save settings, optionally under name"},
  {"load[name]", "load settings, optionally from name"},
  {"settings", "show all current settings"},
  {"assign <name> <value>", "assign one setting value"},
  {"post_assign", "apply settings after assign operations"},
  {"callhist_enable", "toggle Call History search"},
  {"callhist_status", "show current Call History status"},
  {"callhist_open [file]", "set/open a Call History file"},
  {"callhist_set [file]", "receive Call History entries until 'end'"},
  {"callhist_search", "interactive Call History search; 'end' exits"},
  {"mem", "show Main CPU memory information"},
  {"memstat [watch|stop]", "show memory once or start/stop 1-second terminal watch"},
  {"kbdiag [on|off|status]", "enable/disable SUB keyboard diagnostics (default off)"},
  {"submem", "alias of memstat"},
  {"addap <ssid> <password>", "add a Wi-Fi access point"},
  {"time [yyyy-mm-ddThh:mm:ss]", "show or set RTC time"},
  {"ntp_stat", "show NTP status"},
  {"disptype0", "select original 1.3-inch OLED"},
  {"disptype1", "select 2.4-inch OLED"},
  {"disptype2", "select mini 1.3-inch OLED"},
  {"reset_display", "reinitialize the display"},
  {"muxtrans", "request transition to MUXTRANS communication"},
  {"flashersd [boot part app spiffs]", "flash selected Sub CPU images from microSD"},
  {"flasher", "flash the minimum Sub CPU firmware"},
  {"subcpu_halt", "hold the Sub CPU in reset"},
  {"reset_settings", "remove saved settings files"},
  {"restart_dvplogger", "restart the Main CPU"},
  {"usb_desc", "show USB device descriptors"},
  {"usbaudio_start", "capture 15 s of IC-705 USB audio into PSRAM"},
  {"usbaudio_stop", "stop USB audio capture and show status"},
  {"usbaudio_stat", "show USB audio capture status"},
  {"usbaudio_free", "release the USB audio PSRAM buffer"},
  {"usbaudio_desc", "show PCM2901 audio descriptors/interface/rate"},
  {"usbaudio_sync", "USB audio ISO scheduling: usbaudio_sync [0|1]"},
  {"usbacmstat", "show ACM address/interface/keying status"},
  {"usbkeyif <n>", "select CDC interface n for DTR/RTS keying"},
  {"usba0/usbadtr/usbarts/usbaboth", "directly test ACM DTR/RTS line states"},
  {"rttytest [n]", "send n RY pairs (default 20) using [STX]/[ETX]"},
  {"rttytx <text>", "send literal RTTY FSK text for two-radio testing"},
  {"rttyrx <text>", "inject decoded RTTY text into display/autofill parser"},
  {"rttyrxreset", "clear RTTY callsign consensus/autofill history"},
  {"rttytest1 <R|Y> [n]", "send LTRS x3 then one repeated test character"},
  {"rttybits", "dump planned Baudot cells from the last RTTY test"},
  {"rttytiming", "show measured USB RTTY symbol timing"},
  {"rttydump", "dump the last 64 measured USB RTTY symbol intervals"},
  {"rttyinvert [0|1]", "show/set USB RTTY MARK/SPACE line polarity"},
  {"serial", "show serial-port allocation"},
  {"send <text>", "send text directly to Serial2"},
  {"i2c_scan", "scan the I2C bus"},
  {"kbread", "show CardKB key codes; Fn+BS exits"},
  {"adcstat", "show ADC statistics"},
  {"gpio<n> <value>", "write MCP GPIO port n"},
  {"cp2105stat", "show CP2105 port status"},
  {"cp2105port0 / cp2105port1", "select CP2105 CAT port"},
  {"cp2105baud0 <baud>", "set CP2105 port 0 baud rate"},
  {"cp2105baud1 <baud>", "set CP2105 port 1 baud rate"},
  {"cp2105ctl <port> <D|R> <0|1>", "directly set CP2105 DTR/RTS on port 0/1"},
  {"cp2105flow <0|1>", "show CP2105 16-byte flow-control block"},
  {"cp2105manual <0|1>", "set CP2105 DTR/RTS to software/manual control"},
  {"cp2105debug", "toggle CP2105 TX/RX debug dump"},
  {"cp2105send0 <text>", "send raw text through CP2105 port 0"},
  {"cp2105send1 <text>", "send raw text through CP2105 port 1"},
  {"ANT0<n> / ANT1<n>", "set external antenna relay 0/1 state"},
  {"POWER [W]", "show/query rig power, or set transmit power in watts"},
  {"RIGANT? / RIGANT1 / RIGANT2", "query/show or set the rig internal ANT1/ANT2"},
  {"ANTALT[n]", "enable antenna alternation after n receptions"},
  {"SIGNAL", "toggle periodic signal/antenna/azimuth display"},
  {"ROT...", "rotator commands: EN, TYPE, NORTH, SOUTH, TR, AZ, STEP, SWEEP"}
};

static void print_terminal_help(Print *out)
{
  out->println("Available Commands:");
  const size_t n = sizeof(terminal_help_entries) / sizeof(terminal_help_entries[0]);
  for (size_t i = 0; i < n; ++i) {
    out->print(terminal_help_entries[i].command);
    out->print(" - ");
    out->println(terminal_help_entries[i].description);
  }
}
// command interpreter
// callhist_set
// dumpqsolog
//

char *strtoupper(char *s) {
  char *p;
  p = s;
  while (*p) {
    *p = toupper(*p);
    p++;
  }
  return s;
}

void play_cw_cmd(char *cmd)
{
  struct radio *radio;
  if (f_mux_transport) {
    char buf[80];
    if (strlen(cmd)<80) {
      sprintf(buf,"playc%s",cmd);
      plogw->f_playing=1;
      // ptt control
      radio=so2r.radio_tx();
      set_ptt_rig(radio,1);
      radio->ptt=1;
      current_command_output()->print("ptt on and ");
      mux_transport.send_pkt(MUX_PORT_MAIN_BRD_CTRL,MUX_PORT_EXT_BRD_CTRL,(unsigned char *)buf,strlen(buf));
      current_command_output()->print("sent ");current_command_output()->println(buf);
      so2r.set_queue_monitor_status(1);
    }
  }
}

