JK1DVP/esp32-jk1dvplog/dvplogger/main/cmd_interp.cpp
void play_wpm_set()
{
  if (f_mux_transport) {
    char buf[20];
    sprintf(buf,"playw%d",cw_spd);
    mux_transport.send_pkt(MUX_PORT_MAIN_BRD_CTRL,MUX_PORT_EXT_BRD_CTRL,(unsigned char *)buf,strlen(buf));
    current_command_output()->print("sent ");current_command_output()->println(buf);
  }
}

void play_wpm_cmd(char *cmd)
{
  if (f_mux_transport) {
    char buf[20];
    sprintf(buf,"playw%s",cmd);
    mux_transport.send_pkt(MUX_PORT_MAIN_BRD_CTRL,MUX_PORT_EXT_BRD_CTRL,(unsigned char *)buf,strlen(buf));
    current_command_output()->print("sent ");current_command_output()->println(buf);
  }
  
}

void play_queue_cmd()
{
  if (f_mux_transport) {
    char buf[20];
    sprintf(buf,"playq");
    mux_transport.send_pkt(MUX_PORT_MAIN_BRD_CTRL,MUX_PORT_EXT_BRD_CTRL,(unsigned char *)buf,strlen(buf));
    current_command_output()->print("sent ");current_command_output()->println(buf);	  
  }
}

void play_stop_cmd() {
  if (f_mux_transport) {
    char buf[20];
    sprintf(buf,"plays");
    mux_transport.send_pkt(MUX_PORT_MAIN_BRD_CTRL,MUX_PORT_EXT_BRD_CTRL,(unsigned char *)buf,strlen(buf));
    current_command_output()->print("sent ");current_command_output()->println(buf);	  
  }
}

void play_string_cmd(char *cmd)
{
  struct radio *radio;
  if (f_mux_transport) {
    char buf[40];
    if (strlen(cmd)<34) {
      // Voice playback starts immediately after PTT is asserted.  Some radios
      // need a short TX-settling interval or the first syllable is clipped.
      // On the SubCPU, a space in a voice string is rendered as 0.1 s silence.
      // Add one only when the message does not already provide leading silence.
      if (cmd[0] == ' ') {
        sprintf(buf,"playp%s",cmd);
      } else {
        sprintf(buf,"playp %s",cmd);
      }
      plogw->f_playing=1;
      // ptt control
      radio=so2r.radio_tx();
      set_ptt_rig(radio,1);
      radio->ptt=1;
      current_command_output()->print("ptt on and ");
      mux_transport.send_pkt(MUX_PORT_MAIN_BRD_CTRL,MUX_PORT_EXT_BRD_CTRL,(unsigned char *)buf,strlen(buf));
      current_command_output()->print("sent ");current_command_output()->println(buf);
      so2r.set_queue_monitor_status(1);
    }
  }
}

namespace {
class CommandOutputScope {
public:
  explicit CommandOutputScope(Stream *output)
      : saved_(command_output) {
    command_output = output ? output : console;
  }

  ~CommandOutputScope() {
    command_output = saved_;
  }

  Stream *get() const { return current_command_output(); }

private:
  Stream *saved_;
};
}  // namespace

void cmd_interp(char *cmd, Stream *output) {
  CommandOutputScope output_scope(output);
  Stream *out = output_scope.get();
  int tmp, tmp1;
  struct radio *radio;
  switch (cmd_interp_state) {
    case 0:  // command line
      out->print("cmd:");
      out->println(cmd);

      if (strcmp(cmd, "ymodem") == 0) {
        if (out != console) {
          out->println("YMODEM ERROR ymodem is available only on the serial console");
          break;
        }
        console_ymodem_begin(out);
        break;
      }
      if (strncmp(cmd, "sdput ", 6) == 0) {
        char name[96];
        unsigned long size = 0;
        unsigned long crc = 0;
        if (out != console) {
          out->println("SDPUT ERROR sdput is available only on the serial console");
          break;
        }
        if (sscanf(cmd + 6, "%95s %lu %lx", name, &size, &crc) != 3 || size == 0) {
          out->println("usage: sdput <filename> <size> <crc32-hex>");
          break;
        }
        console_sdput_begin(name, (uint32_t)size, (uint32_t)crc, out);
        break;
      }
      if (strcmp("loadsat", cmd) == 0) {
	load_satinfo();
        break;
      }
      if (strncmp(cmd, "POWER", 5) == 0) {
        struct radio *radio = so2r.radio_selected();
        int watts = -1;
        const char *p = cmd + 5;
        while (*p == ' ') ++p;
        if (*p != '\0' && sscanf(p, "%d", &watts) == 1) {
          if (watts < 0 || watts > 100) {
            out->println("usage: POWER [5..100]");
          } else {
            set_power(radio, watts);
            out->printf("POWER set request %d W\\r\\n", watts);
          }
        } else {
          send_power_query_civ(radio);
          out->printf("POWER current=%d W", radio->power);
          if (radio->rig_spec &&
              radio->rig_spec->rig_type == RIG_TYPE_YAESU_FTX1)
            out->printf(" source=%d", radio->power_source);
          out->println();
        }
        break;
      }
      if (strncmp(cmd, "RIGANT", 6) == 0) {
        struct radio *radio = so2r.radio_selected();
        if (!rig_antenna_supported(radio)) {
          out->println("RIGANT unsupported by selected rig");
          break;
        }
        const char *p = cmd + 6;
        while (*p == ' ') ++p;
        if (*p == '1' && p[1] == '\0') {
          set_rig_antenna(radio, 1, true);
          out->printf("RIGANT set ANT1 band=%d\\r\\n", radio->bandid);
        } else if (*p == '2' && p[1] == '\0') {
          set_rig_antenna(radio, 2, true);
          out->printf("RIGANT set ANT2 band=%d\\r\\n", radio->bandid);
        } else if (*p == '\0' || (*p == '?' && p[1] == '\0')) {
          send_rig_antenna_query(radio);
          const int saved = (radio->bandid >= 1 && radio->bandid <= N_BAND)
                              ? radio->rig_antenna_band[radio->bandid] : -1;
          out->printf("RIGANT current=%d saved-band=%d band=%d\\r\\n",
                      radio->rig_antenna, saved, radio->bandid);
        } else {
          out->println("usage: RIGANT? | RIGANT1 | RIGANT2");
        }
        break;
      }
      if (rotator_commands(cmd)) break;
      if (antenna_switch_commands(cmd)) {
		  break;
	  }
      if (signal_command(cmd)) break;
      if (antenna_alternate_command(cmd)) break;
      if (strcmp("savesat", cmd) == 0) {
	save_satinfo();
        break;
      }
      if (strcmp(cmd,"decoderstop")==0) {
	decoder.stop_i2s_adc_24k_rms_task(); // stop morse decoder
	out->print("stopped morse decoder");
	break;
      }
      if (strcmp(cmd,"decoder")==0) {
	decoder.start_i2s_adc_24k_rms_task();// start morse decoder
	out->print("started morse decoder");
	break;
      }

