JK1DVP/esp32-jk1dvplog/dvplogger/main/cmd_interp.cpp
      if (strncmp(cmd, "cp2105ctl ", 10) == 0) {
        int port = -1, on = -1;
        char line = 0;
        if (sscanf(cmd + 10, "%d %c %d", &port, &line, &on) != 3 ||
            (port != 0 && port != 1) ||
            (line != 'D' && line != 'd' && line != 'R' && line != 'r') ||
            (on != 0 && on != 1)) {
          out->println("usage: cp2105ctl <0|1> <D|R> <0|1>");
          break;
        }
        CP2105controlTest((uint8_t)port, line, on != 0, out);
        break;
      }

      if (strncmp(cmd, "cp2105flow ", 11) == 0) {
        int port = atoi(cmd + 11);
        if (port < 0 || port > 1) out->println("usage: cp2105flow <0|1>");
        else CP2105flowStatus((uint8_t)port, out);
        break;
      }
      if (strncmp(cmd, "cp2105manual ", 13) == 0) {
        int port = atoi(cmd + 13);
        if (port < 0 || port > 1) out->println("usage: cp2105manual <0|1>");
        else CP2105setManualFlow((uint8_t)port, out);
        break;
      }

      if (strcmp(cmd, "cp2105debug") == 0) {
	CP2105toggleDebug();
	break;
      }
      if (strncmp(cmd, "cp2105send0 ", 12) == 0) {
	CP2105sendRaw(0, cmd + 12);
	return;
      }

      if (strncmp(cmd, "cp2105send1 ", 12) == 0) {
	CP2105sendRaw(1, cmd + 12);
	return;
      }      
      
      if (strcmp(cmd, "emu") == 0) {
        // enter into console terminal emulation mode
        plogw->f_console_emu = 1;
	// send clear screen command
	char buf[40];	
	for (int i=0;i<20;i++) {
	  sprintf(buf,"\033[%d;1H\033[K",i);
	  out->print(buf);
	}
        break;
      }
      
      if (strncmp(cmd,"play ",5)==0) {
	// play_string
	out->println("play command");
	play_string_cmd(cmd+5);
	break;
      }
      if (strncmp(cmd,"playcw",6)==0) {
	// play_string
	out->println("playcw command");
	play_cw_cmd(cmd+6);
	break;
      }
      if (strncmp(cmd,"playwpm",7)==0) {
	// play queue query
	out->println("playwpm command");
	play_wpm_cmd(cmd+7);
	break;
      }
      if (strncmp(cmd,"playq",5)==0) {
	// play queue query
	out->println("playq command");
	play_queue_cmd();
	break;
      }
      if (strcmp(cmd,"serial")==0) {
	// status of serial port allocation
	print_serial_instance(out);
	break;
      }
      if (strncmp(cmd, "send ", 5) == 0) {
	//        SO2Rprint(cmd + 5);
	Serial2.println(cmd+5);
	out->print("sent Serial2:");out->println(cmd+5);
        break;
      }
      if (strcmp(cmd,"i2c_scan")==0) {
	// scan i2c bus and print result
	i2c_scan(out);
	break;
      }
      if (strcmp(cmd,"usb_desc")==0) {
	USB_desc();
	break;
      }
      if (strcmp(cmd,"usbacmstat")==0) {
        USBACMstatus(out);
        break;
      }
      if (strncmp(cmd,"usbkeyif ",9)==0) {
        unsigned long iface = strtoul(cmd + 9, NULL, 0);
        USBACMselectKeyInterface((uint8_t)iface, out);
        break;
      }
      if (strcmp(cmd,"usba0")==0) {
        USBACMcontrolTest(0x00, out);
        break;
      }
      if (strcmp(cmd,"usbadtr")==0) {
        USBACMcontrolTest(0x01, out);
        break;
      }
      if (strcmp(cmd,"usbarts")==0) {
        USBACMcontrolTest(0x02, out);
        break;
      }
      if (strcmp(cmd,"usbaboth")==0) {
        USBACMcontrolTest(0x03, out);
        break;
      }
      if (strncmp(cmd,"rttyrx ",7)==0) {
        RTTYDecoderFeedText(cmd + 7, true);
        out->printf("RTTYRX: injected: %s\n", cmd + 7);
        break;
      }
      if (strcmp(cmd,"rttyrxreset")==0) {
        RTTYDecoderResetAutofill();
        out->println("RTTYRX: autofill history reset");
        break;
      }
      if (strncmp(cmd,"rttytx ",7)==0) {
        struct radio *r = so2r.radio_tx();
        if (!r || r->modetype != LOG_MODETYPE_DG) {
          out->println("RTTYTX: TX radio must be in RTTY/DG mode");
          break;
        }
        if (r->f_tone_keying || (rig_fsk_port(r->rig_spec) != 3 && rig_fsk_port(r->rig_spec) != 4)) {
          out->println("RTTYTX: select FSK:3(DTR) or FSK:4(RTS)");
          break;
        }
        RTTYbaudotDiagReset();
        append_rtty_test_text(cmd + 7);
        out->printf("RTTYTX: queued literal text: %s\n", cmd + 7);
        break;
      }
      if (strncmp(cmd,"rttytest",8)==0 && (cmd[8]=='\0' || cmd[8]==' ')) {
        int n = 20;
        if (cmd[8]==' ') n = atoi(cmd + 9);
        if (n < 1) n = 1;
        if (n > 40) n = 40;
        struct radio *r = so2r.radio_tx();
        if (!r || r->modetype != LOG_MODETYPE_DG) {
          out->println("RTTYTEST: TX radio must be in RTTY/DG mode");
          break;
        }
        if (r->f_tone_keying || (rig_fsk_port(r->rig_spec) != 3 && rig_fsk_port(r->rig_spec) != 4)) {
          out->println("RTTYTEST: select FSK:3(DTR) or FSK:4(RTS)");
          break;
        }
        char testbuf[96];
        char *q = testbuf;
        *q++ = CW_MSCMD_RTTY_STX_CHR;
        for (int i=0; i<n && q < testbuf + sizeof(testbuf) - 3; ++i) {
          *q++ = 'R';
          *q++ = 'Y';
        }
        *q++ = CW_MSCMD_RTTY_ETX_CHR;
        *q = '\0';
        RTTYbaudotDiagReset();
        append_cwbuf_string(testbuf);
        out->printf("RTTYTEST: queued %d RY pairs, FSK:%d RP:%d lead=%d ms\n",
                    n, rig_fsk_port(r->rig_spec),
                    rig_rtty_invert(r->rig_spec) ? 1 : 0, rtty_ptt_lead_ms);
        break;
      }
      if (strncmp(cmd,"rttytest1 ",10)==0) {
        char ch = cmd[10];
        if (ch >= 'a' && ch <= 'z') ch = (char)(ch - 'a' + 'A');
        if (ch != 'R' && ch != 'Y') {
          out->println("RTTYTEST1: use rttytest1 R [n] or rttytest1 Y [n]");
          break;
        }
        int n = 12;
        const char *np = cmd + 11;
        while (*np == ' ') ++np;
        if (*np) n = atoi(np);
        if (n < 1) n = 1;
        if (n > 24) n = 24;
        struct radio *r = so2r.radio_tx();
        if (!r || r->modetype != LOG_MODETYPE_DG) {
          out->println("RTTYTEST1: TX radio must be in RTTY/DG mode");
          break;
        }
        if (r->f_tone_keying || (rig_fsk_port(r->rig_spec) != 3 && rig_fsk_port(r->rig_spec) != 4)) {
          out->println("RTTYTEST1: select FSK:3(DTR) or FSK:4(RTS)");
          break;
        }
        RTTYbaudotDiagReset();
        append_rtty_test1(ch, n);
        out->printf("RTTYTEST1: queued LTRS x3 + %c x%d, FSK:%d RP:%d lead=%d ms\n",
                    ch, n, rig_fsk_port(r->rig_spec),
                    rig_rtty_invert(r->rig_spec) ? 1 : 0, rtty_ptt_lead_ms);
        out->printf("Expected %c code=%u: START=S D0=%c D1=%c D2=%c D3=%c D4=%c STOP=M + 0.5M\n",
                    ch, ch == 'R' ? 10 : 21,
                    ch == 'R' ? 'S' : 'M', ch == 'R' ? 'M' : 'S',
                    ch == 'R' ? 'S' : 'M', ch == 'R' ? 'M' : 'S',
                    ch == 'R' ? 'S' : 'M');
        break;
      }
      if (strcmp(cmd,"rttybits")==0) {
        RTTYbaudotDiagDump(out);
        break;
      }
      if (strcmp(cmd,"rttytiming")==0) {
        USBRTTYtimingStatus(out);
        break;
      }
      if (strcmp(cmd,"rttydump")==0) {
        USBRTTYtimingDump(out);
        break;
      }
      if (strcmp(cmd,"rttyinvert")==0) {
        out->printf("USB RTTY invert=%d (logical MARK -> line %s)\n",
                    USBRTTYgetInvert() ? 1 : 0,
                    USBRTTYgetInvert() ? "deasserted" : "asserted");
        break;
      }
      if (strncmp(cmd,"rttyinvert ",11)==0) {
        const char *p = cmd + 11;
        while (*p == ' ') ++p;
        if ((p[0] != '0' && p[0] != '1') || p[1] != '\0') {
          out->println("RTTYINVERT: use rttyinvert 0 or rttyinvert 1");
          break;
        }
        USBRTTYsetInvert(p[0] == '1', out);
        break;
      }
      if (strcmp(cmd,"usbaudio_start")==0) {
        usb_audio_capture_start(out);
        break;
      }
      if (strcmp(cmd,"usbaudio_stop")==0) {
        usb_audio_capture_stop(out);
        break;
      }
      if (strcmp(cmd,"usbaudio_stat")==0) {
        usb_audio_capture_status(out);
        break;
      }
      if (strcmp(cmd,"usbaudio_free")==0) {
        usb_audio_capture_free(out);
        break;
      }
      if (strcmp(cmd,"usbaudio_desc")==0) {
        usb_audio_capture_diagnose(out);
        break;
      }
      if (strcmp(cmd,"usbaudio_sync")==0) {
        out->printf("USB AUDIO: SOF sync=%d\n",
                    usb_audio_capture_sof_sync() ? 1 : 0);
        break;
      }
      if (strncmp(cmd,"usbaudio_sync ",14)==0) {
        const char *p = cmd + 14;
        while (*p == ' ') ++p;
        if ((p[0] != '0' && p[0] != '1') || p[1] != '\0') {
          out->println("USBAUDIO_SYNC: use usbaudio_sync 0 or usbaudio_sync 1");
          break;
        }
        usb_audio_capture_set_sof_sync(p[0] == '1', out);
        break;
      }
      if (strcmp(cmd,"cp2105stat")==0) {
	CP2105status(out);
	break;
      }
      if (strcmp(cmd,"cp2105port0")==0 || strcmp(cmd,"cp2105port1")==0) {
	CP2105selectPort(cmd[strlen(cmd)-1]-'0');
	break;
      }
      if (strncmp(cmd,"cp2105baud0 ",12)==0 || strncmp(cmd,"cp2105baud1 ",12)==0) {
	uint8_t port = cmd[10]-'0';
	uint32_t baud = strtoul(cmd+12, NULL, 10);
	if (!CP2105setBaud(port, baud)) out->println("CP2105 baud setting failed");
	break;
      }

      if (strcmp(cmd,"kbread")==0) {
	while(1) {
	  Wire.requestFrom(0x5F, 1);
	  while(Wire.available())	  {
	    char c = Wire.read(); // receive a byte as characterif
	    if (c != 0) {
	      if (c==0x8b) { // Fn+BS exit from kbread
		out->println("exit from kbread");
		goto end_kb;
	      }
	      out->print("cardkb:");
	      if (isprint(c)) {
		out->print(c);
		out->print(":");		
	      } else {
		out->print(":");
	      }
	      out->println(c, HEX);
	    }
	  }
	  delay(10);
	}
      end_kb:
	break;
      }

      if (strcmp(cmd,"ntp_stat")==0) {
	print_ntpstatus(out);
	break;
      }

      if (strcmp(cmd,"reset_display")==0) {
	  out->print("init_display()");
	  init_display();
	  break;
      }
      if (strncmp(cmd,"flashersd",9)==0) {
        out->println("flashersd boot part app spiffs (put what you want to flash).");
        out->println("[FLASHERSD] entering exclusive maintenance mode");

        // flashersd owns SD for the entire operation. Main-loop jobs are
        // naturally blocked by this synchronous call; stop the two known
        // independent users as well: AsyncWebServer callbacks and AudioPlayer.
        suspend_webserver_for_flash();
        player.stop();
        uint32_t audio_deadline = millis() + 1000;
        while (player.isPlaying() && (int32_t)(millis() - audio_deadline) < 0)
          delay(10);
        if (player.isPlaying())
          out->println("[FLASHERSD] warning: AudioPlayer did not stop within 1 s");

        // Close MAIN's normal SD writer before the flasher starts streaming.
        close_qsolog();

