JK1DVP/esp32-jk1dvplog/dvplogger/main/cmd_interp.cpp
        // UART2 is temporarily owned by esp-serial-flasher, not MUX.
        const bool subcpu_was_online = subcpu_online;
        deinit_mux_serial();
        out->printf("[FLASHERSD] exclusive ready: uart2_driver=%d\n",
                    uart_is_driver_installed(UART_NUM_2) ? 1 : 0);

        esp_flasher_sd(cmd+9);

        out->println("[FLASHERSD] flasher returned; restoring services");
        if (subcpu_was_online) {
          init_mux_serial();
        } else {
          f_mux_transport = 0;
          mux_transport.mux_stream = NULL;
          out->println("[FLASHERSD] SUBCPU was offline at boot; reboot to enable normal MUX services");
        }
        resume_webserver_after_flash();
        out->println("[FLASHERSD] exclusive maintenance mode ended");
        break;
      }

      if (strcmp(cmd, "kbdiag on") == 0) {
        set_subkbd_diag(true, out);
        break;
      }
      if (strcmp(cmd, "kbdiag off") == 0) {
        set_subkbd_diag(false, out);
        break;
      }
      if (strcmp(cmd, "kbdiag") == 0 ||
          strcmp(cmd, "kbdiag status") == 0) {
        query_subkbd_diag(out);
        break;
      }

      if (strcmp(cmd,"memstat watch")==0) {
        start_memstat_watch(out);
        break;
      }
      if (strcmp(cmd,"memstat stop")==0) {
        stop_memstat_watch(out);
        break;
      }
      if (strcmp(cmd,"submem")==0 || strcmp(cmd,"memstat")==0) {
        request_memstat_main_subcpu(true, out);
        break;
      }
      if (strcmp(cmd,"subcpu_halt")==0) {
	// keep subcpu reset pin low to halt subcpu
	//const uint8_t reset_trigger_mcp_pin = 15;
	mcp_write_pin(15, 0);
	out->println("halted subcpu by keep en pin low.");
	break;
      }
      
      if (strcmp(cmd,"flasher")==0) {
	// stop mux serial port
	deinit_mux_serial();
	close_qsolog();
	out->println("esp_flasher() ... ");
	esp_flasher();
	out->println("esp_flasher() end... ");	
	// restore mux serial port
	init_mux_serial();
      	break;
      }
      if (strncmp(cmd, "verbose", 7) == 0) {
        tmp1 = sscanf(cmd + 7, "%d", &tmp);
        if (tmp1 == 1) {
          verbose = tmp;
        } else {
          if (verbose > 0) {
            verbose = 0;
          } else {
            verbose = 1;
          }
        }
        out->printf("verbose=%d\n", verbose);
        break;
      }
      if (strncmp(cmd, "clusterverbose", 14) == 0) {
        int cluster_no = 0;
        int level = 0;
        int n = sscanf(cmd + 14, "%d %d", &cluster_no, &level);
        if (n == 0) {
          print_cluster_verbose_status(out);
        } else if (n == 2) {
          set_cluster_verbose_level(cluster_no, level, out);
        } else {
          out->println("usage: clusterverbose [1|2] [0-3]");
          print_cluster_verbose_status(out);
        }
        break;
      }
      if (strncmp(cmd, "c1cmd", 5) == 0 &&
          (cmd[5] == '\0' || cmd[5] == ' ' || cmd[5] == '\t')) {
        send_cluster_terminal_cmd(1, cmd + 5, out);
        break;
      }
      if (strncmp(cmd, "c2cmd", 5) == 0 &&
          (cmd[5] == '\0' || cmd[5] == ' ' || cmd[5] == '\t')) {
        send_cluster_terminal_cmd(2, cmd + 5, out);
        break;
      }
      if (strncmp(cmd, "nextaos", 7) == 0) {
	start_calc_nextaos();
        break;
      }
      if (strcmp(cmd, "satellite") == 0) {
        f_sat_updated = 0;  // reset flag
	allocate_sat();
	getTLE();
        break;
      }
      if (strncmp(cmd,"addap ",6)==0) {
	out->println("addap command");	
	char arg1[100];char arg0[100];
	copy_token(arg0,cmd+6,0," ");
	copy_token(arg1,cmd+6,1," ");
	multiwifi_addap(arg0,arg1);

	break;
      }

      if (strncmp(cmd, "gpio", 4) == 0) {
        int tmp, tmp1;
        if (sscanf(cmd + 4, "%d %d", &tmp, &tmp1) == 2) {
	  write_mcp_gpio(tmp,tmp1);

          out->print("write mcp gpio port ");
          out->print(tmp);
          out->print(" value ");
          out->println(tmp1);
          for (int i = 0; i < 16; i++) {
            out->print(i);
            out->print(" ");
            out->println(read_mcp_gpio(i));
          }
        } else {
          out->println("gpio mcp param error");
        }
        break;
      }



      if (strcmp(cmd, "zmerge") == 0) {
        zserver_start_merge(false);
        break;
      }
      if (strcmp(cmd, "zmerge dry") == 0) {
        zserver_start_merge(true);
        break;
      }
      if (strcmp(cmd, "zmerge repair") == 0) {
        zserver_start_repair();
        break;
      }

      if (strcmp(cmd, "listdir") == 0) {
        listDir(SD, "/", 0, out);
        break;
      }
      if (strcmp(cmd, "help") == 0) {
        print_terminal_help(out);
        break;
      }
      if (strncmp("callhist_set", cmd, 12) == 0) {
        out->println("callhist_set command");
        if (cmd[12] == ' ') {
          set_callhistfn(cmd + 13);
        } else {
          set_callhistfn("");
        }
        cmd_interp_state = 1;
        break;
      }
      if (strncmp(cmd, "DX de", 5) == 0) {
        // cluster info push from serial
        get_info_cluster(cmd);
        break;
      }
      if (strcmp("mem",cmd)==0) {
	print_memory();
	break;
      }
      if (strcmp("dumpcur",cmd)==0) {
	dump_qso_current(out);
	break;
      }
      if (strcmp("dumptop",cmd)==0) {
	info_disp.pos=0;
	dump_qso_current(out);
	break;
      }
      if (strcmp("dumpnext",cmd)==0) {
	info_disp.pos+=sizeof(qso.all);
	dump_qso_current(out);
	break;
      }
      if (strcmp("dumpprev",cmd)==0) {
	info_disp.pos-=sizeof(qso.all);
	if (info_disp.pos<0) info_disp.pos=0;
	dump_qso_current(out);
	break;
      }
      if (strcmp("dumplast", cmd) == 0) {      
	unsigned long pos = qsologf.position();
	info_disp.pos = pos - sizeof(qso.all);
	if (info_disp.pos < 0) {
	  info_disp.pos = 0;
	}
	dump_qso_current(out);
	break;
      }

      if (strncmp("dump ",cmd,5) == 0) {
        int tmp, tmp1;
        if (sscanf(cmd + 5, "%d", &tmp) == 1) {
	  unsigned long pos = qsologf.position();
	  if (tmp*sizeof(qso.all) <= pos) {
	    info_disp.pos = tmp* sizeof(qso.all);
	    if (info_disp.pos < 0) {
	      info_disp.pos = 0;
	    }
	    dump_qso_current(out);
	  } else {
	    out->print(tmp);
	    out->println(", beyond range <");
	    out->print(pos/sizeof(qso.all));
	  }
	} else {
	    out->println("dump qso#(0-)");
	}
	break;
      }
      
      if (strncmp("dumpqso", cmd, 7) == 0) {
        out->println("dumpqso command");
        out->println(cmd + 8);
	if (strlen(cmd)>7) {
	  dump_qso_bak(cmd + 8, out);
	} else {
	  out->println("dumping current qso log.");	  
	  dump_qso_log(out);
	}
        break;
      }

      
