JK1DVP/esp32-jk1dvplog/dvplogger/main/cmd_interp.cpp
      if (strncmp("readqso", cmd, 7) == 0) {
        out->println("readqso command");
        read_qso_log(READQSO_PRINT, out);
        break;
      }
      if (strcasecmp(cmd, "listqsofile") == 0) {
        list_qso_backup_files();
        break;
      }
      if (strncasecmp(cmd, "switchlog", 9) == 0) {
        const char *arg = cmd + 9;
        while (*arg == ' ') arg++;
        char *endp = NULL;
        long n = strtol(arg, &endp, 10);
        if (arg == endp || *endp != '\0' || n < 0 || n > 999) {
          out->println("Usage: SWITCHLOGnnn");
          snprintf(dp->lcdbuf, sizeof(dp->lcdbuf),
                   "Usage:\nSWITCHLOGnnn");
          upd_display_info_flash(dp->lcdbuf);
        } else {
          switch_qso_log((int)n);
        }
        break;
      }
      if (strncmp("mailqso", cmd, 7) == 0) {
        out->println("mailsqso command");
	//        mail_qso_log();
        break;
      }

      if (strncmp("status", cmd, 7) == 0) {
        // get status of the radios
        print_status_console();
        break;
      }

      if (strncmp("setstninfo", cmd, 10) == 0) {
        // set target to work station information
        set_target_station_info(cmd + 11);
        break;
      }

      if (strncmp("load", cmd, 4) == 0) {
        // load setting
        load_settings(cmd + 4);
        break;
      }
      if (strncmp("assign", cmd, 6) == 0) {
        // assign variables similarly to load/save file.
        if (!plogw->f_console_emu) {
          out->print("assign:");
          out->print(cmd + 7);
          out->println(":");
        }
        assign_settings(cmd + 7, settings_dict);
        break;
      }
      if (strcmp("post_assign", cmd) == 0) {
        // setting after assigning variables
        radio_list[0].enabled = plogw->radios_enabled & 1;
        radio_list[1].enabled = (plogw->radios_enabled >> 1) & 1;
        radio_list[2].enabled = (plogw->radios_enabled >> 2) & 1;
        set_rig_from_name(&radio_list[0]);
        set_rig_from_name(&radio_list[1]);
        set_rig_from_name(&radio_list[2]);
        set_contest_id();
        set_cluster();
        break;
      }
      if (strncmp("contest_id", cmd, 10) == 0) {
        int tmp, tmp1;
        if (sscanf(cmd + 10, "%d", &tmp) == 1) {
	  if (tmp <0 || tmp >= N_CONTEST) {
	    out->println("contest_id out of range");
	    break;
	  }
	  plogw->contest_id =tmp;
	  set_contest_id();
	  out->print("contest:");
	  out->println(plogw->contest_name+2);
        } else {
          out->println("contest_id contest_id#");
        }
        break;
      }
      if (strcmp("show_multi",cmd)==0) {      
	print_multi_list(out);
	break;
      }
      if (strcmp(cmd,"disptype1")==0) {
	out->print("reset_display() type1");
	display_type=1;
	init_display();
	break;
      }
      if (strcmp(cmd,"disptype0")==0) {
	out->print("reset_display() type0");
	display_type=0;
	init_display();
	break;
      }
      if (strcmp(cmd,"disptype2")==0) {
	out->print("reset_display() type2");
	display_type=2;
	init_display();
	break;
      }
      if (strcmp(cmd,"muxtrans")==0) {
	f_mux_transport_cmd=1; // transition to mux
	sprintf(dp->lcdbuf,"mux_transport->mux\ncurrent=%d",f_mux_transport);
	upd_display_info_flash(dp->lcdbuf);
	break;
      }
      if (strcmp("show_bandmap",cmd)==0) {
	upd_display_bandmap();
	break;
      }
      if (strcmp("show_summary",cmd)==0) {
	show_summary(out);
	break;
      }	
      if (strcmp("callhist_enable",cmd)==0) {
        if (plogw->enable_callhist) {
          plogw->enable_callhist = 0;
        } else {
          plogw->enable_callhist = 1;
        }
        if (!plogw->f_console_emu) {
          out->print("callhist en =");
          out->println(plogw->enable_callhist);
        }
        if (plogw->enable_callhist) {
          if (!plogw->f_console_emu) out->println("open callhist");
          int n = 0;
          if (callhist_at == 1) {
            if (load_callhist_subcpu(callhistfn)) {
              n = get_callhist_subcpu_count();
            }
          } else {
            n = read_callhist_list(callhistfn);
          }
          out->printf("callhist at=%s entries=%d\n",
                                 callhist_at ? "SUBCPU" : "MAIN", n);
        } else {
          if (!plogw->f_console_emu) out->println("close callhist");
          close_callhist();
        }
        sprintf(dp->lcdbuf, "callhist en:%d\nDone.\n", plogw->enable_callhist);
        if (!plogw->f_console_emu) out->println(dp->lcdbuf);
        break;
      }	
      if (strcmp("settings", cmd) == 0) {
        dump_settings(out, settings_dict);
        break;
      }
      if (strncmp("save", cmd, 4) == 0) {
        // release other settings  including sat
        release_memory();
        save_settings(cmd + 4);
        if (!plogw->f_console_emu) out->println("save");
        break;
      }
      if (strcmp("switch_bands",cmd)==0) {
	struct radio *radio;
	radio=so2r.radio_selected();
	switch_bands(radio);
	break;
      }
      if (strncmp("set_rig ",cmd,8) == 0) {
	struct radio *radio;
	radio=so2r.radio_selected();
	strcpy(radio->rig_name + 2, cmd+8);
	set_rig_from_name(radio);
	sprintf(dp->lcdbuf,"Rig set:%s",radio->rig_name+2);
	out->println(dp->lcdbuf);
	break;
      }
      if (strncmp("switch_radio", cmd, 12) == 0) {
        int tmp, tmp1;
        if (sscanf(cmd + 12, "%d", &tmp) == 1) {
          switch_radios(tmp, -1);
        } else {
          out->println("switch_radio radio#");
        }
        break;
      }
      if (strncmp("enable_radio", cmd, 12) == 0) {
        int tmp, tmp1;
        if (sscanf(cmd + 12, "%d", &tmp) == 1) {
          enable_radios(tmp, -1);
        } else {
          out->println("enable_radio radio#");
        }
        break;
      }
      if (strncmp("makedupe", cmd, 8) == 0 ) {
        // Use the same rebuild path as startup/contest changes/late SUBCPU
        // recovery.  Keeping one path makes startup and manual MAKEDUPE
        // directly comparable and avoids subtly different initialization.
        out->println("MAKEDUPE manual: rebuild scheduled");
        request_makedupe_rebuild();
        break;
      }
      if (strncmp("focus", cmd, 5) == 0) {
        int new_focus;
        if (sscanf(cmd + 5, "%d", &new_focus) == 1) {
          so2r.change_focused_radio(new_focus);
        }
        break;
      }

      if (strcmp(cmd, "newqsolog") == 0) {
        // create new QSO log
        create_new_qso_log();
        break;
      }

      if (strcmp(cmd,"reset_settings")==0) {
        // Remove settings and other personal/preference files used for
        // development/testing.  Deliberately preserve QSO.TXT and QSO.*
        // backup/log files so an accidental reset_settings cannot destroy
        // irreplaceable QSO records.
        static const char *files_to_remove[] = {
          "/settings.txt",
          "/ch.txt",
          "/wifiset.txt",
          "/wifiset.new",
          "/spiffs.bin",
          "/rigs.txt",
          "/CALLHIST.TXT",
          "/CONTEST.TXT",
          "/QSOBAK.TXT",
          "/QSOTMP.TXT",
          "/qsomail.txt",
          "/satdb.tmp",
          "/satdb.bak",
          "/satinfo.txt",
          "/satdb.txt"
        };

