JK1DVP/esp32-jk1dvplog/dvplogger/main/cmd_interp.cpp
        out->println("reset_settings: removing settings/personal files");
        for (size_t i = 0;
             i < sizeof(files_to_remove) / sizeof(files_to_remove[0]);
             ++i) {
          const char *fn = files_to_remove[i];
          if (SD.exists(fn)) {
            if (SD.remove(fn)) {
              out->print("removed ");
              out->println(fn);
            } else {
              out->print("FAILED to remove ");
              out->println(fn);
            }
          }
        }
        out->println("reset_settings: QSO.TXT and QSO.* files preserved");
	break;
      }
      if (strcmp(cmd,"restart_dvplogger")==0) {
        out->println("restarting DVPlogger by esp32 reset...");
	delay(1000);
	ESP.restart();
	break;
      }
      if (strcmp("adcstat",cmd)==0) {
	adc_statistics();
	break;
      }
      if (strncmp("time",cmd,4)==0) {
	// read/set time from RTC chip
	if (cmd[4]==' ') {
	  // set
	  set_rtcclock(cmd+5); // yymmddhhmmss to set 	  
	} else {
	  print_rtcclock();
	  out->println("set by time yyyy-mm-ddThh:mm:ss  . ");
	}
	break;
      }

      if (strcmp("callhist_status", cmd) == 0) {
        show_callhist_status();
        break;
      }
      if (strncmp("callhist_open", cmd, 13) == 0) {
        if (cmd[13] == ' ') {
          set_callhistfn(cmd + 14);
        } else {
          set_callhistfn("");
        }
        open_callhist();
        break;
      }
      if (strcmp("callhist_search", cmd) == 0) {
        out->println("callhist_search command");
        cmd_interp_state = 2;
        break;
      }
      // other commands follow
      out->println("???");
      break;
    case 1:  // after callhist_set commsnd
      if (strcmp("end", cmd) == 0) {
        out->println("callhist_set end");
	close_callhistf();
	//        callhistf.close();
        callhistf_stat = 0;
        // open callhist
        open_callhist();
        cmd_interp_state = 0;
      } else {
        write_callhist(strtoupper(cmd));
      }
      break;
    case 2:  // call history search
      if (strcmp("end", cmd) == 0) {
        out->println("callhist_search end");
        cmd_interp_state = 0;
        break;
      }
      search_callhist(strtoupper(cmd));
      break;
  }
}


void cmd_interp(char *cmd) {
  cmd_interp(cmd, plogw->ostream ? plogw->ostream : console);
}
